package example.list;

import java.util.LinkedList;

/**
 * @ClassName ListDemo02
 * @Description 此类用于演示功能
 * @Author Shark
 * @DateTime 2022年07月15日 10时07分20秒
 * @Version 1.0
 *
 * 数组结构:
 *      含义:集合底层使用数组来存储数据
 *      特点:
 *          "数组结构"的查询效率相比"链表结构"高
 *          "数组结构"的增删效率相比"链表结构"低
 *
 * 链表结构:
 *      含义:其实就是Java程序中的"类",不断进行"套娃"的类
 *      分类:
 *          单向链表结构
 *              链表类含有至少两个属性:
 *                  当前元素(泛型类型)
 *                  下一个链表对象(链表类的类型)
 *          双向链表结构
 *              链表类含有至少三个属性:
 *                  当前元素(泛型类型)
 *                  下一个链表对象(链表类的类型)
 *                  上一个链表对象(链表类的类型)
 *      特点:
 *          "链表结构"的查询效率相比"数组结构"要低
 *          "链表结构"的增删效率相比"数组结构"要高
 *          "链表结构"可以快速操作首尾两个链表对象
 *      注意:
 *          链表结构越长,链表效率越低
 */
public class ListDemo02 {
    public static void main(String[] args) {

    }
}
